app/views/flowers/index.html.slim

SELECT `flower_tags`.* FROM `flower_tags` WHERE `flower_tags`.`flower_id` = '283'
SELECT `flowers`.* FROM `flowers` WHERE 1=0
---
          li style="display: flex;"
            - fl.flower_tag.each do |tag|
              .pallete__small style="background: ##{tag.tag};"
                .color-description = "#{tag.tag}"