app/controllers/flowers_controller.rb

  def index
    if params[:search]
      @flowers_results = Flower.__elasticsearch__.search("*#{params[:search]}*")
      @ids = @flowers_results.map{|f| f.id}
      @flowers = Flower.where(id: @ids)
---
SELECT `flowers`.* FROM `flowers` WHERE 1=0
SELECT `flowers`.* FROM `flowers` WHERE `flowers`.`id` IN (295, 300, 313, 340, 343, 351, 356, 283, 303, 324)